app/views/lists/_list.html.erb

        <div class="task_list">
            <%list.tasks.each do |task|%>
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."list_id" = 14