app/views/notes/_note.html.erb


$(function(){
    $('.stickyNote')
        .draggable({
            stop: function(e, ui) {
                $.ajax({
                    url: '/notes/' + $(this).attr('data-noteId'),
                    type: 'PUT',
                    data: { _method:'PUT', x: $(this).position().left, y: $(this).position().top,
                        width: $(this).width(), height: $(this).height(), body: $(this).find('.textarea').html() },
                    dataType: 'json',
                    success: function(data) {
                        //alert('put sent');
                  }
                });
            }
        })
        .resizable({
            stop: function(e, ui) {
                $.ajax({
                    url: '/notes/' + $(this).attr('data-noteId'),
                    type: 'PUT',
---
SELECT "notes".* FROM "notes"