app/views/notes/destroy.js.erb

DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 32]]
---
$('.delete_note').bind('ajax:success', function(){
	$(this).closest('tr').fadeOut();
});