app/views/users/destroy.js.erb

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]
---
$('.delete_user').bind('ajax:success', function(){
	$(this).closest('tr').fadeOut();
});