app/controllers/lists_controller.rb

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 8
---
  def index
    @lists = current_user.lists.all

SELECT "lists".* FROM "lists" WHERE "lists"."user_id" = 8 AND "lists"."id" = 14 LIMIT 1
INSERT INTO "tasks" ("body", "complete", "created_at", "list_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "sdfs"], ["complete", false], ["created_at", Wed, 17 Apr 2013 02:19:10 UTC +00:00], ["list_id", 14], ["updated_at", Wed, 17 Apr 2013 02:19:10 UTC +00:00]]
---
  def create_task
    list = current_user.lists.find_by_id(params[:list_id])
    @task = list.tasks.new(:body => params[:body], :complete => params[:complete])

    respond_to do |format|
      if @task.save

INSERT INTO "lists" ("created_at", "height", "updated_at", "user_id", "width", "x", "y") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", Tue, 16 Apr 2013 18:47:15 UTC +00:00], ["height", nil], ["updated_at", Tue, 16 Apr 2013 18:47:15 UTC +00:00], ["user_id", 9], ["width", nil], ["x", nil], ["y", nil]]
---
  def create
    @list = current_user.lists.new(params[:list])

    respond_to do |format|
      if @list.save

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "14"]]
UPDATE "lists" SET "x" = 605, "y" = 261, "width" = 150, "height" = 150, "updated_at" = '2013-04-17 02:36:50.104832' WHERE "lists"."id" = 17
---
  def update
    @list = List.find(params[:id])

    respond_to do |format|
      if @list.update_attributes(:x => params[:x], :y => params[:y], :width=>params[:width], :height=>params[:height])

SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", "16"]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 16]]
---
  def destroy
    @list = List.find(params[:id])
    @list.destroy