app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "5"]]
---
  def edit
    @note = Note.find(params[:id])