app/controllers/notes_controller.rb

SELECT "notes".* FROM "notes" WHERE "notes"."user_id" = 8
---
  def index
    @notes = current_user.notes.all

INSERT INTO "notes" ("board_id", "body", "created_at", "title", "updated_at", "width", "x", "y") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["board_id", nil], ["body", nil], ["created_at", Sun, 07 Apr 2013 23:20:33 UTC +00:00], ["title", nil], ["updated_at", Sun, 07 Apr 2013 23:20:33 UTC +00:00], ["width", nil], ["x", nil], ["y", nil]]
---
  def create
    @note = current_user.notes.new(params[:note])
    respond_to do |format|
      if @note.save

SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "29"]]
UPDATE "notes" SET "x" = 309, "y" = -15, "body" = 'asdfsdfsdf&lt;div&gt;&lt;br&gt;&lt;/div&gt;&lt;div&gt;&lt;br&gt;&lt;/div&gt;', "updated_at" = '2013-04-08 15:51:06.515179' WHERE "notes"."id" = 50
---
  def update
    @note = Note.find(params[:id])
    #updatedNote = {params}

    respond_to do |format|
      if @note.update_attributes(:x => params[:x], :y => params[:y], :body=>params[:body], :width=>params[:width], :height=>params[:height])

SELECT "notes".* FROM "notes" WHERE "notes"."id" = ? LIMIT 1  [["id", "3"]]
DELETE FROM "notes" WHERE "notes"."id" = ?  [["id", 3]]
---
  def destroy
    @note = Note.find(params[:id])
    @note.destroy