app/controllers/tasks_controller.rb

  def update
    @task = Task.find(params[:id])

    respond_to do |format|
      if @task.update_attributes(:body => params[:body], :complete => params[:complete])
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", "undefined"]]
UPDATE "tasks" SET "body" = '[object Object]', "complete" = 't', "updated_at" = '2013-04-17 02:25:02.304348' WHERE "tasks"."id" = 7